[Killed] BlockStatement
src/Item.mjs:9:38
   #quality;
   #name;
 
-  constructor(name, sellIn, quality) {
-    this.#name = name;
-    this.#sellIn = sellIn;
-    this.#quality = this.#isLegendary() ? this.#LEGENDARY_QUALITY : quality;
-  }
+  constructor(name, sellIn, quality) {}
 
   update() {
killedBy: Gilded Rose sulfuras should not change quality
statusReason: expected NaN to equal 80

[Killed] BlockStatement
src/Item.mjs:15:12
     this.#quality = this.#isLegendary() ? this.#LEGENDARY_QUALITY : quality;
   }
 
-  update() {
-    if (this.#isLegendary()) {
-      return;
-    }
-    switch (true) {
-      case this.#isConjured():
-        this.#updateConjured();
-        break;
-
-      case this.#isAged():
-        this.#updateAged();
-        break;
-
-      case this.#isTicket():
-        this.#updateTicket();
-        break;
-
-      default:
-        this.#updateNormal();
-        break;
-    }
-  }
+  update() {}
 
   sellIn() {
killedBy: Gilded Rose aged brie should increase quality
statusReason: expected 1 to equal 2

[Killed] BlockStatement
src/Item.mjs:16:30
   }
 
   update() {
-    if (this.#isLegendary()) {
-      return;
-    }
+    if (this.#isLegendary()) {}
     switch (true) {
       case this.#isConjured():
killedBy: Gilded Rose sulfuras should not change quality
statusReason: expected 79 to equal 80

[Killed] ConditionalExpression
src/Item.mjs:16:9
   }
 
   update() {
-    if (this.#isLegendary()) {
+    if (false) {
       return;
     }
killedBy: Gilded Rose sulfuras should not change quality
statusReason: expected 79 to equal 80

[Killed] BooleanLiteral
src/Item.mjs:19:13
     if (this.#isLegendary()) {
       return;
     }
-    switch (true) {
+    switch (false) {
       case this.#isConjured():
         this.#updateConjured();
killedBy: Gilded Rose aged brie should increase quality
statusReason: expected +0 to equal 2

[Killed] ConditionalExpression
src/Item.mjs:20:7
       return;
     }
     switch (true) {
-      case this.#isConjured():
-        this.#updateConjured();
-        break;
+      case this.#isConjured():
 
       case this.#isAged():
killedBy: Gilded Rose conjured item should decrease quality by 2 when it is not out of date
statusReason: expected 5 to equal 2

[Killed] ConditionalExpression
src/Item.mjs:24:7
         this.#updateConjured();
         break;
 
-      case this.#isAged():
-        this.#updateAged();
-        break;
+      case this.#isAged():
 
       case this.#isTicket():
killedBy: Gilded Rose aged brie should increase quality
statusReason: expected 4 to equal 2

[Killed] ConditionalExpression
src/Item.mjs:28:7
         this.#updateAged();
         break;
 
-      case this.#isTicket():
-        this.#updateTicket();
-        break;
+      case this.#isTicket():
 
       default:
killedBy: Gilded Rose backstage passes should increase quality by 1 when sell in is 11 or more
statusReason: expected +0 to equal 2

[Killed] ConditionalExpression
src/Item.mjs:32:7
         this.#updateTicket();
         break;
 
-      default:
-        this.#updateNormal();
-        break;
+      default:
     }
   }
killedBy: Gilded Rose basic item should decrease quality by 1
statusReason: expected 1 to equal +0

[Killed] BlockStatement
src/Item.mjs:38:12
     }
   }
 
-  sellIn() {
-    return this.#sellIn;
-  }
+  sellIn() {}
 
   quality() {
killedBy: Gilded Rose sulfuras should not change sell in
statusReason: expected undefined to equal 1

[Killed] BlockStatement
src/Item.mjs:42:13
     return this.#sellIn;
   }
 
-  quality() {
-    return this.#quality;
-  }
+  quality() {}
 
   name() {
killedBy: Gilded Rose sulfuras should not change quality
statusReason: expected undefined to equal 80

[Killed] BlockStatement
src/Item.mjs:46:10
     return this.#quality;
   }
 
-  name() {
-    return this.#name;
-  }
+  name() {}
 
   #updateAged() {
killedBy: Gilded Rose items name should not change
statusReason: expected undefined to equal 'foo'

[Killed] BlockStatement
src/Item.mjs:50:17
     return this.#name;
   }
 
-  #updateAged() {
-    this.#sellIn--;
-    const increase = this.#isOutOfDate() ? 2 : 1;
-    this.#increaseQuality(increase);
-  }
+  #updateAged() {}
 
   #updateTicket() {
killedBy: Gilded Rose aged brie should increase quality
statusReason: expected 1 to equal 2

[Killed] UpdateOperator
src/Item.mjs:51:5
   }
 
   #updateAged() {
-    this.#sellIn--;
+    this.#sellIn++;
     const increase = this.#isOutOfDate() ? 2 : 1;
     this.#increaseQuality(increase);
killedBy: Gilded Rose aged brie should still increase quality when sell in is 0 or less
statusReason: expected 2 to equal 3

[Killed] BlockStatement
src/Item.mjs:56:19
     this.#increaseQuality(increase);
   }
 
-  #updateTicket() {
-    let increase = 1;
-    if (this.#sellIn <= 10) {
-      increase++;
-    }
-    if (this.#sellIn <= 5) {
-      increase++;
-    }
-    this.#sellIn--;
-    this.#isOutOfDate() ? (this.#quality = 0) : this.#increaseQuality(increase);
-  }
+  #updateTicket() {}
 
   #updateNormal() {
killedBy: Gilded Rose backstage passes should increase quality by 1 when sell in is 11 or more
statusReason: expected 1 to equal 2

[Killed] ConditionalExpression
src/Item.mjs:58:9
 
   #updateTicket() {
     let increase = 1;
-    if (this.#sellIn <= 10) {
+    if (false) {
       increase++;
     }
killedBy: Gilded Rose backstage passes should increase quality by 2 when sell in is between 6 and 10
statusReason: expected 2 to equal 3

[Killed] BlockStatement
src/Item.mjs:58:29
 
   #updateTicket() {
     let increase = 1;
-    if (this.#sellIn <= 10) {
-      increase++;
-    }
+    if (this.#sellIn <= 10) {}
     if (this.#sellIn <= 5) {
       increase++;
killedBy: Gilded Rose backstage passes should increase quality by 2 when sell in is between 6 and 10
statusReason: expected 2 to equal 3

[Killed] UpdateOperator
src/Item.mjs:59:7
   #updateTicket() {
     let increase = 1;
     if (this.#sellIn <= 10) {
-      increase++;
+      increase--;
     }
     if (this.#sellIn <= 5) {
killedBy: Gilded Rose backstage passes should increase quality by 2 when sell in is between 6 and 10
statusReason: expected 1 to equal 3

[Killed] EqualityOperator
src/Item.mjs:61:9
     if (this.#sellIn <= 10) {
       increase++;
     }
-    if (this.#sellIn <= 5) {
+    if (this.#sellIn < 5) {
       increase++;
     }
killedBy: Gilded Rose backstage passes should increase quality by 3 when sell in is 5 or less
statusReason: expected 3 to equal 4

[Killed] ConditionalExpression
src/Item.mjs:61:9
     if (this.#sellIn <= 10) {
       increase++;
     }
-    if (this.#sellIn <= 5) {
+    if (false) {
       increase++;
     }
killedBy: Gilded Rose backstage passes should increase quality by 3 when sell in is 5 or less
statusReason: expected 3 to equal 4

[Killed] UpdateOperator
src/Item.mjs:62:7
       increase++;
     }
     if (this.#sellIn <= 5) {
-      increase++;
+      increase--;
     }
     this.#sellIn--;
killedBy: Gilded Rose backstage passes should increase quality by 3 when sell in is 5 or less
statusReason: expected 2 to equal 4

[Killed] UpdateOperator
src/Item.mjs:64:5
     if (this.#sellIn <= 5) {
       increase++;
     }
-    this.#sellIn--;
+    this.#sellIn++;
     this.#isOutOfDate() ? (this.#quality = 0) : this.#increaseQuality(increase);
   }
killedBy: Gilded Rose backstage passes should drop quality to 0 when sell in is less than 0
statusReason: expected 4 to equal +0

[Killed] BlockStatement
src/Item.mjs:68:19
     this.#isOutOfDate() ? (this.#quality = 0) : this.#increaseQuality(increase);
   }
 
-  #updateNormal() {
-    this.#sellIn--;
-    const decrease = this.#isOutOfDate() ? 2 : 1;
-    this.#decreaseQuality(decrease);
-  }
+  #updateNormal() {}
 
   #updateConjured() {
killedBy: Gilded Rose basic item should decrease quality by 1
statusReason: expected 1 to equal +0

[Killed] UpdateOperator
src/Item.mjs:69:5
   }
 
   #updateNormal() {
-    this.#sellIn--;
+    this.#sellIn++;
     const decrease = this.#isOutOfDate() ? 2 : 1;
     this.#decreaseQuality(decrease);
killedBy: Gilded Rose basic item should decrease quality by 2 when sell in is less than 0
statusReason: expected 1 to equal +0

[Killed] BlockStatement
src/Item.mjs:74:21
     this.#decreaseQuality(decrease);
   }
 
-  #updateConjured() {
-    this.#sellIn--;
-    const decrease = this.#isOutOfDate() ? 4 : 2;
-    this.#decreaseQuality(decrease);
-  }
+  #updateConjured() {}
 
   #isConjured() {
killedBy: Gilded Rose conjured item should decrease quality by 2 when it is not out of date
statusReason: expected 4 to equal 2

[Killed] UpdateOperator
src/Item.mjs:75:5
   }
 
   #updateConjured() {
-    this.#sellIn--;
+    this.#sellIn++;
     const decrease = this.#isOutOfDate() ? 4 : 2;
     this.#decreaseQuality(decrease);
killedBy: Gilded Rose conjured item should decrease quality by 4 when it is out of date
statusReason: expected 2 to equal +0

[Killed] BlockStatement
src/Item.mjs:80:17
     this.#decreaseQuality(decrease);
   }
 
-  #isConjured() {
-    return this.#name === "Conjured Item";
-  }
+  #isConjured() {}
 
   #isAged() {
killedBy: Gilded Rose conjured item should decrease quality by 2 when it is not out of date
statusReason: expected 3 to equal 2

[Killed] ConditionalExpression
src/Item.mjs:81:12
   }
 
   #isConjured() {
-    return this.#name === "Conjured Item";
+    return false;
   }
 
killedBy: Gilded Rose conjured item should decrease quality by 2 when it is not out of date
statusReason: expected 3 to equal 2

[Killed] ConditionalExpression
src/Item.mjs:81:12
   }
 
   #isConjured() {
-    return this.#name === "Conjured Item";
+    return true;
   }
 
killedBy: Gilded Rose aged brie should increase quality
statusReason: expected +0 to equal 2

[Killed] BlockStatement
src/Item.mjs:84:13
     return this.#name === "Conjured Item";
   }
 
-  #isAged() {
-    return this.#name === "Aged Brie";
-  }
+  #isAged() {}
 
   #isTicket() {
killedBy: Gilded Rose aged brie should increase quality
statusReason: expected +0 to equal 2

[Killed] ConditionalExpression
src/Item.mjs:85:12
   }
 
   #isAged() {
-    return this.#name === "Aged Brie";
+    return true;
   }
 
killedBy: Gilded Rose backstage passes should increase quality by 2 when sell in is between 6 and 10
statusReason: expected 2 to equal 3

[Killed] ConditionalExpression
src/Item.mjs:85:12
   }
 
   #isAged() {
-    return this.#name === "Aged Brie";
+    return false;
   }
 
killedBy: Gilded Rose aged brie should increase quality
statusReason: expected +0 to equal 2

[Killed] BlockStatement
src/Item.mjs:88:15
     return this.#name === "Aged Brie";
   }
 
-  #isTicket() {
-    return this.#name === "Backstage passes to a TAFKAL80ETC concert";
-  }
+  #isTicket() {}
 
   #isLegendary() {
killedBy: Gilded Rose backstage passes should increase quality by 1 when sell in is 11 or more
statusReason: expected +0 to equal 2

[Killed] ConditionalExpression
src/Item.mjs:89:12
   }
 
   #isTicket() {
-    return this.#name === "Backstage passes to a TAFKAL80ETC concert";
+    return false;
   }
 
killedBy: Gilded Rose backstage passes should increase quality by 1 when sell in is 11 or more
statusReason: expected +0 to equal 2

[Killed] ConditionalExpression
src/Item.mjs:89:12
   }
 
   #isTicket() {
-    return this.#name === "Backstage passes to a TAFKAL80ETC concert";
+    return true;
   }
 
killedBy: Gilded Rose basic item should decrease quality by 1
statusReason: expected 4 to equal +0

[Killed] BlockStatement
src/Item.mjs:92:18
     return this.#name === "Backstage passes to a TAFKAL80ETC concert";
   }
 
-  #isLegendary() {
-    return this.#name === "Sulfuras, Hand of Ragnaros";
-  }
+  #isLegendary() {}
 
   #isOutOfDate() {
killedBy: Gilded Rose sulfuras should not change quality
statusReason: expected 79 to equal 80

[Killed] ConditionalExpression
src/Item.mjs:93:12
   }
 
   #isLegendary() {
-    return this.#name === "Sulfuras, Hand of Ragnaros";
+    return false;
   }
 
killedBy: Gilded Rose sulfuras should not change quality
statusReason: expected 79 to equal 80

[Killed] ConditionalExpression
src/Item.mjs:93:12
   }
 
   #isLegendary() {
-    return this.#name === "Sulfuras, Hand of Ragnaros";
+    return true;
   }
 
killedBy: Gilded Rose aged brie should increase quality
statusReason: expected 80 to equal 2

[Killed] BlockStatement
src/Item.mjs:96:18
     return this.#name === "Sulfuras, Hand of Ragnaros";
   }
 
-  #isOutOfDate() {
-    return this.#sellIn < 0;
-  }
+  #isOutOfDate() {}
 
   #increaseQuality(amount = 1) {
killedBy: Gilded Rose aged brie should still increase quality when sell in is 0 or less
statusReason: expected 2 to equal 3

[Killed] EqualityOperator
src/Item.mjs:97:12
   }
 
   #isOutOfDate() {
-    return this.#sellIn < 0;
+    return this.#sellIn <= 0;
   }
 
killedBy: Gilded Rose aged brie should increase quality
statusReason: expected 3 to equal 2

[Killed] ConditionalExpression
src/Item.mjs:97:12
   }
 
   #isOutOfDate() {
-    return this.#sellIn < 0;
+    return true;
   }
 
killedBy: Gilded Rose aged brie should increase quality
statusReason: expected 3 to equal 2

[Killed] BlockStatement
src/Item.mjs:100:32
     return this.#sellIn < 0;
   }
 
-  #increaseQuality(amount = 1) {
-    this.#quality = Math.min(this.#quality + amount, this.#MAX_QUALITY);
-  }
+  #increaseQuality(amount = 1) {}
 
   #decreaseQuality(amount = 1) {
killedBy: Gilded Rose aged brie should increase quality
statusReason: expected 1 to equal 2

[Killed] ArithmeticOperator
src/Item.mjs:101:30
   }
 
   #increaseQuality(amount = 1) {
-    this.#quality = Math.min(this.#quality + amount, this.#MAX_QUALITY);
+    this.#quality = Math.min(this.#quality - amount, this.#MAX_QUALITY);
   }
 
killedBy: Gilded Rose aged brie should increase quality
statusReason: expected +0 to equal 2

[Killed] BlockStatement
src/Item.mjs:104:32
     this.#quality = Math.min(this.#quality + amount, this.#MAX_QUALITY);
   }
 
-  #decreaseQuality(amount = 1) {
-    this.#quality = Math.max(this.#quality - amount, this.#MIN_QUALITY);
-  }
+  #decreaseQuality(amount = 1) {}
 }
killedBy: Gilded Rose basic item should decrease quality by 1
statusReason: expected 1 to equal +0

[Killed] ArithmeticOperator
src/Item.mjs:105:30
   }
 
   #decreaseQuality(amount = 1) {
-    this.#quality = Math.max(this.#quality - amount, this.#MIN_QUALITY);
+    this.#quality = Math.max(this.#quality + amount, this.#MIN_QUALITY);
   }
 }
killedBy: Gilded Rose basic item should decrease quality by 1
statusReason: expected 2 to equal +0
