[Killed] BlockStatement
src/Shop.mjs:6:19
     this.items = items;
   }
 
-  updateQuality() {
-    for (var i = 0; i < this.items.length; i++) {
-      this.items[i].update();
-    }
-    return this.items;
-  }
+  updateQuality() {}
 }
 
killedBy: Gilded Rose sulfuras should not change quality
statusReason: Cannot read properties of undefined (reading '0')
